#include<stdio.h>											//輸入stdio.h函數庫 
#include<stdlib.h>											//輸入stdlib.h函數庫
#include<conio.h>											//輸入conio.h函數庫
#include<windows.h>											//輸入windows.h函數庫
#include<time.h>											//輸入time.h函數庫
char ch,yn;													//宣告字元 
int num,xx,x,i,j;											//宣告變數
int seat[9][9]={0};											//宣告9x9矩陣座位
void Aa();													//宣告副程式
void Bb();														
void Cc();													
void Dd();
void run();
void end();
void menu();
void menu(void){										
	printf("~~~~~~~~[選位系統]~~~~~~~~~\n");               
	printf("* (a)Available seats      *\n");
	printf("* (b)Arrange for you      *\n");
	printf("* (c)Choose by yourself   *\n");
	printf("* (d)Exit                 *\n");
	printf("~~~~~~~~~~~~~~~~~~~~~~~~~~~\n");
}
void end(void){
printf("我覺得這一次的作業有點難，花了我好久才做完，但是藉由這次的作業，使我更了解應該如何操作。");	
}
void run (void){
	scanf("%c",&ch);                                	//由鍵盤輸入字元並指定給ch儲存
	fflush(stdin);										//清除緩衝區的資料
	switch(ch){											//判斷ch條件 
	case 'a':                                  			//ch符合'a'     
		system("cls");									//清除螢幕
		Aa();											//執行副程式Aa()
		menu();											//執行副程式menu()
		printf("請輸入一個字元\n");                     //印出 " " 裡面的東西
		run();											//執行副程式run()
		break;
	case 'b':	                                		//ch符合b'  
		system("cls");									//清除螢幕
		Bb();											//執行副程式Bb()
		menu();											//執行副程式menu()
		printf("請輸入一個字元\n");                     //印出 " " 裡面的東西
		run();											//執行副程式run()
		break;                                  		
	case 'c':											//ch符合'c'
		system("cls");                                 	//清除螢幕
		Cc();											//執行副程式Cc()
		menu();											//執行副程式menu()
		printf("請輸入一個字元\n");                     //印出 " " 裡面的東西
		run();											//執行副程式run()
		break;
	case 'd':											//ch符合'd'
		system("cls");                                 	//清除螢幕
		Dd();											//執行副程式Dd()
		menu();											//執行副程式menu()
		printf("請輸入一個字元\n");                     //印出 " " 裡面的東西
		run();											//執行副程式run()
		break;
	default:											//都不符合 
		system("cls");									//清除螢幕
		end();											//執行副程式end()
		exit(0);										//結束程式 
	}
}
void Aa(void){
	int i,j;
    printf("\\123456789\n");

    for(i=0;i<=8;i++)									//雙層迴圈印出陣列是0印出-是1印出*/
	{	 
    	printf("%d",9-i);																				
        for(j=0;j<=8;j++)
		{
            if(seat[i][j]==0)printf("-");
            if(seat[i][j]==1)printf("*");
        }
        printf("\n");																		
    }
    if (getch()){										//若按下鍵盤						
		system("cls");									//清除螢幕
	}
}
void Bb(void){											//不會寫
	int n;
	printf("請問需要幾個座位(1~4):");											
	scanf("%d",&n);	
	fflush(stdin);											
}
void Cc(void){
	char yn;
	char z1,z,z2,esc;
	int i,j;
	int a,b;
			
	while(1){
		printf("請輸入想要的座位 第幾排-第幾個\n");														
		z1=getche();									//儲存字元變數 
		z=getche();
		z2=getche();
		fflush(stdin);
		if(z1<'1'||z1>'9'){								//座位介於9x9 
			printf("輸入錯誤，請重新輸入\n");										
			continue;
		}
		if(z2<'1'||z2>'9'){
			printf("輸入錯誤，請重新輸入\n");										
			continue;
		}
		if(z!=45){
			printf("格式錯誤，請重新輸入\n");											
			continue;
		}
		a=z1-'0'-9; 									//ascii code轉成數字
		a<0?a=a*(-1):1;									//轉成第幾排
		b=z2-'0'-1;										//ascii code轉成數字
		if(seat[a][b]==1){
			printf("此座位已有人，請重新輸入\n"); 									
		}
		else{
			seat[a][b]=2;
		}
		printf("\n");
		printf("按esc結束或任意鍵繼續\n");
		esc=getch();									//按下esc結束		
		if(esc==27){
			break;
		}
	}																	
		printf("\\123456789\n");															
		for(i=0;i<=8;i++){
		printf("%d",9-i);															
		for(j=0;j<=8;j++){								//印出選位後的座位表 
			if(seat[i][j]==0)printf("-");
			if(seat[i][j]==1)printf("*");
			if(seat[i][j]==2)printf("@");
		}
		printf("\n");													
		}
		printf("確認無誤請按任意鍵回到選單\n");
		fflush(stdin);
		if (getch()){
			system("cls");
		}
}
void Dd(void){											
	printf("Continue?(y/n)\n");							//印出 " " 裡面的東西
	printf("是否要重新輸入\n");	 
	scanf("%c",&yn);									//由鍵盤輸入字元並指定給yn儲存
	fflush(stdin);										//清除緩衝區的資料
	if(yn=='y'||yn=='Y'){								//若yn='y'或'Y' 
		system("cls");									//清除螢幕 
		menu();											//執行副程式menu() 
		printf("請輸入一個字元\n");						//印出 " " 裡面的東西
		run();											//執行副程式run()
	}
	else if(yn=='N'||yn=='n'){						 	//否則若yn='N'或'n' 
		system("cls");									//清除螢幕
		end();											//執行副程式end()
		exit(0);										//結束程式 
	}
	else{												//否則 
			printf("錯誤訊息重新輸入\n");				//印出 " " 裡面的東西
			Dd();										//執行副程式Cc() 
	}
}
int main(){
    printf("------------------------------------------------------------------------------------\n"); 
	printf("        			.::::----------..                     .::::.                    \n");    
    printf("      			.:-::-------------:::.                  .-::...                     \n");
    printf("			...:--..:::-::-----===--::::-:               .-:::::.                   \n");  
	printf("		.::--::::::....:.:::--===----:::::--      ::----------:--                   \n");   
    printf("	:-::::::::.....::...::--===-----:::::::-     =-------------                     \n");  
    printf("    -::::::::::.::::::::::------:--::::::..:.     :-----:----=-:                    \n");  
    printf("     ...::.....::::::.:-:::::--::::::::::::::          ....----==:                  \n");  
    printf("       :......::::::::::::::::::::::. ..:.::.              .=-----=-.               \n");  
    printf("      :.......::.::::::::::::::::::..    ..:                ---======-              \n");  
    printf("     ::........:::::...:::::::::-:.::.......                .=-========.            \n");  
    printf("     -::::...:::::.:..:::::::.:::::::::..:                  :+==========.           \n");  
    printf("    :::::::::::::::::::::::::.:::::::---:                   -==-=======-=.          \n");  
    printf("    ::::-::-----:..::::::..:::::::----.                    .==---=========          \n");  
    printf("    -::::-::-----::::......::::-:..               ---:    :--:-----------=:         \n");  
    printf("    -:::::::-----::......::::---                .=---=   :-:::::::---:----=         \n");  
    printf("    :::::::::-----:..::. ::::-=.               .=-----:---:-:::::::::::----.        \n");  
    printf("    .-:-:::::::::...:.   .:::-                 -----------::::::::::::::::-.        \n");  
    printf("     :--::::::::   :       ..             .-===-------------:::::-::::::::-.        \n");  
    printf("      -:::::-:......                   .:===-==-=---------:::::::--:::::::-         \n");  
    printf("       -:::::::::::                   ----========-------:::::------::::---         \n");  
    printf("        :..:::::::-                 .---===----------::::-----:----:::::--.         \n");  
    printf("         ::::::::-=                .---=-----------::::::::-::-----:------          \n");  
    printf("          .--:---==:               ----------==-----------:--:------:----           \n");  
    printf("            .--=====.              =-----------==--===----------::-:----.           \n");  
    printf("              .-==--=------:       =---=================-------:----:------.        \n");  
    printf("                 ----==---=-==.    :=---=========+====+=====----------::---:        \n");  
    printf("                -=---======--=:     ---------===============-----:-------:          \n");  
    printf("               ---====..::::.        :=------====--===-=-=-------::::..             \n");  
    printf("               -----=.                .-==---==---------=---=-:                     \n");  
    printf("               -::--.                   .:----:::::-------:.                        \n");  
    printf("                ::.                         ..:::::::..                             \n");  
	printf("------------------------------------------------------------------------------------\n");
	do{																//執行	
    printf("請輸入4個數字密碼\n");                                  //印出 " " 裡面的東西
    scanf("%d",&num);                                               //由鍵盤輸入整數並指定給num儲存
    fflush(stdin);													//清除緩衝區的資料
	if(num==2022){                                                  //若num=2021 
		xx=4;														//xx為錯誤次數=4 
	}
	else{															//否則 
		xx++; 														//錯誤次數+1
	}
	}while(xx<3);													//當錯誤次數小於3 
	if(xx==3){														//若錯誤次數=3 
		printf("警告\n");											//印出 " " 裡面的東西
		Sleep(500);													//停0.5秒
		system("cls");												//清除螢幕
	}
	else{															//否則 
		printf("歡迎");                                           	//印出 " " 裡面的東西
		Sleep(500);													//停0.5秒
		system("cls");                                              //清除螢幕
		srand(time(NULL));
		for(x=1;x<=10;x++){	
        i=rand()%9;
        j=rand()%9;
        if(seat[i][j]==1)x--;
        seat[i][j]=1;
    }		
		menu();														//執行副程式menu()
		printf("請輸入一個字元\n");                             	//印出 " " 裡面的東西
		run();														//執行副程式run()
	}
  
	end();												     		//執行副程式end()
	system("pause");                                    			//呼叫pause指令，用來暫停程式的執行
	return 0;														//執行完畢，傳回整數0
 }
	
